app/controllers/tweets_controller.rb

  def index
    # get initial tweets
    tweets = Tweet.includes(:response, :user)
    .where('tweets.initial_tweet_id IS NULL')
    .paginate(page: params[:page], per_page: 4)
    .order(created_at: :desc)

    # pair initial tweets with their response
    @tweet_pairs = []
    tweets.each do |tweet|
      @tweet_pairs << [tweet, tweet.response]
---
SELECT "tweets".* FROM "tweets" WHERE (tweets.initial_tweet_id IS NULL)  ORDER BY "tweets"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (6, 7)
SELECT COUNT(*) FROM "tweets" WHERE (tweets.initial_tweet_id IS NULL)
SELECT  "tweets".* FROM "tweets" INNER JOIN "users" ON "users"."id" = "tweets"."user_id" WHERE (users.screen_name = 'realdonaldtrump')  ORDER BY "tweets"."created_at" ASC LIMIT 1
SELECT "users".* FROM "users"
INSERT INTO "tweets" ("tweet_id_str", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["tweet_id_str", "813848942001659904"], ["text", "Happy Holidays https://t.co/fxLFQQWJG7"], ["created_at", "2017-01-04 06:41:06.751569"], ["updated_at", "2017-01-04 06:41:06.751569"]]